package main

import (
	"AtlHyper/atlhyper_metrics/config"
	"AtlHyper/atlhyper_metrics/push"
)

func main() {
	 config.MustLoad()
	// 启动 Agent 的 HTTP 服务，监听端口 8083（可根据需要修改）
	push.StartPushServer(8083)
}

//现在时装了两个方法。这两种方法的底层调用逻辑是同一个。

//==================================================
//第一个是主动查询，把查询结果返回给调用方。但是仅作为调试用。
//并且采用的是nodeprot的方式，提供了一个 RESTful API 接口。
//==================================================

//========================================================
//第二种是主动上报，定期把采集到的快照主动 Push 到 Agent 接收端。
//该方法采用的是对接agent的接收端口，进行主动上报。
//========================================================